<?php

namespace Database\Seeders;

use App\Models\ShowMeta;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ShowMetaSeeder extends Seeder
{
    /**
     * Run the database seeders.
     */
    public function run(): void
    {
        DB::table((new ShowMeta())->getTable())->insert([
            [
                'show_id' => 1,
                'h1' => 'Шепіт ночі: Таємнича вистава в Театральному Порталі',
                'title' => 'Купити квитки на виставу \'Шепіт ночі\' - Інформація та ціни | Театральний Портал',
                'description' => 'Дізнайтеся більше про таємничу виставу \'Шепіт ночі\'. Розкривайте найглибші таємниці у світі ночі. Купуйте квитки за доступною ціною.',
                'keywords' => 'вистава, Шепіт ночі, таємнича вистава, ніч, театр, квитки',
                'created_at' => (new \DateTime()),
                'updated_at' => (new \DateTime()),
            ],
            [
                'show_id' => 2,
                'h1' => 'Танець світла: Захоплююча вистава в Театральному Порталі',
                'title' => 'Купити квитки на виставу \'Танець світла\' - Інформація та ціни | Театральний Портал',
                'description' => 'Дізнайтеся більше про захоплюючу виставу \'Танець світла\'. Розкривайте таємниці світла та танцю у неймовірній атмосфері. Купуйте квитки за доступною ціною.',
                'keywords' => 'вистава, Танець світла, світло, танець, театр, квитки',
                'created_at' => (new \DateTime()),
                'updated_at' => (new \DateTime()),
            ],
            [
                'show_id' => 3,
                'h1' => 'Симфонія сну: Чарівна вистава в Театральному Порталі',
                'title' => 'Купити квитки на виставу \'Симфонія сну\' - Інформація та ціни | Театральний Портал',
                'description' => 'Дізнайтеся більше про чарівну виставу \'Симфонія сну\'. Поглибіться у світ снів, де музика, кольори та танці створюють неймовірну симфонію. Купуйте квитки за доступною ціною.',
                'keywords' => 'вистава, Симфонія сну, сни, музика, танці, театр, квитки',
                'created_at' => (new \DateTime()),
                'updated_at' => (new \DateTime()),
            ],
            [
                'show_id' => 4,
                'h1' => 'Легенди прадавнього лісу: Захоплююча вистава в Театральному Порталі',
                'title' => 'Купити квитки на виставу \'Легенди прадавнього лісу\' - Інформація та ціни | Театральний Портал',
                'description' => 'Дізнайтеся більше про захоплюючу виставу \'Легенди прадавнього лісу\'. Відправтеся у магічний світ легенд та відьом. Купуйте квитки за доступною ціною.',
                'keywords' => 'вистава, Легенди прадавнього лісу, легенди, відьми, театр, квитки',
                'created_at' => (new \DateTime()),
                'updated_at' => (new \DateTime()),
            ],
        ]);
    }
}
